crowdwave/ch559samplestranslated/EVT/EXAM/USB/U_DISK/EXAM9/EXAM9.C
* Output: None
* Return:
************************************************** *****************************/
UINT8 InitRootDevice( UINT8 RootHubIndex)
{
    UINT8 i, s, cfg, dv_cls, if_cls;
    printf( "Reset host port\n" );
    ResetRootHubPort( RootHubIndex ); // After detecting the device, reset the USB bus of the corresponding port
    for (i = 0, s = 0; i <100; i ++) // wait for the USB device to reset and reconnect, 100mS timeout
    {
        mDelaymS( 1 );
        if (EnableRootHubPort( RootHubIndex) == ERR_SUCCESS) // Enable port
        {
            i = 0;
            s ++; // Time to wait for the stability of the USB device connection
            if (s> 20)
            {
                break; // has been connected stably for 20mS
            }
        }
    }
    if (i) // device is not connected after reset
    {
        DisableRootHubPort( RootHubIndex );
        printf( "Disable host port because of disconnect\n" );
        return( ERR_USB_DISCON );
    }
SelectHubPort( RootHubIndex);
    printf( "GetDevDescr: ");
    s = CtrlGetDeviceDescr( ); // Get device descriptor
    if (s == ERR_SUCCESS)
    {
        for (i = 0; i <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL; i ++)
        {
            printf( "x%02X ", (UINT16)( TxBuffer[i]) );
        }
        printf( "\n" ); // display the descriptor
        dv_cls = ((PXUSB_DEV_DESCR)TxBuffer) -> bDeviceClass; // device class code
s = CtrlSetUsbAddress( RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL );//Set the USB device address, plus RootHubIndex can ensure that 2 HUB ports are assigned different addresses
        if (s == ERR_SUCCESS)
        {
RootHubDev[RootHubIndex].DeviceAddress = RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL;// Save the USB address
            printf( "GetCfgDescr: ");
            s = CtrlGetConfigDescr( ); // Get configuration descriptor
            if (s == ERR_SUCCESS)
            {
                cfg = ((PXUSB_CFG_DESCR)TxBuffer) -> bConfigurationValue;
                for (i = 0; i <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL; i ++)
                {
                    printf( "x%02X ", (UINT16)( TxBuffer[i]) );
                }
                printf("\n");
                /* Analyze the configuration descriptor, get the endpoint data/each endpoint address/each endpoint size, etc., update the variables endp_addr and endp_size, etc. */
                if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceClass;// Interface class code
                if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE) // It is a USB storage device, basically confirm it is a U disk
                {
// s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
// if (s == ERR_SUCCESS) {
RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_STORAGE;
printf( "USB-Disk Ready\n" );
SetUsbSpeed( 1 ); // The default is full speed
return( ERR_SUCCESS );
//}
                }
             }
         }
}
    printf( "InitRootDev Err = %02X\n", (UINT16)s );
    CH559DiskStatus = DISK_CONNECT;
    SetUsbSpeed( 1 ); // The default is full speed
    return( s );
}

/************************************************* ******************************
* Function Name: EnumAllRootDevice
* Description: Enumerate all USB devices of ROOT-HUB port
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
UINT8 EnumAllRootDevice( void)
{
UINT8 s, RootHubIndex;
printf( "EnumAllRootDev\n" );
for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++) {
if (RootHubDev[RootHubIndex].DeviceStatus == ROOT_DEV_CONNECTED) {// The device has just been inserted and has not been initialized
s = InitRootDevice( RootHubIndex ); // Initialize/enumerate the USB device of the specified HUB port
if (s != ERR_SUCCESS) return( s );
}
}
return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: SearchTypeDevice
* Description: Search for the port number where the specified type of device is located on ROOT-HUB, and the output port number is 0xFFFF, but it is not found
                   The upper 8 bits of the output are the ROOT-HUB port number, the lower 8 bits are the port number of the external HUB, and the lower 8 bits are 0, the device is directly on the ROOT-HUB port
                   Of course, you can also search according to the PID of the USB manufacturer's VID product (record the VID and PID of each device in advance), and specify the search serial number
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
UINT16 SearchTypeDevice( UINT8 type)
{
UINT8 RootHubIndex;
for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++) {// The current search can avoid the problem that the device is unplugged in the middle and some information is not updated in time
if (RootHubDev[RootHubIndex].DeviceType == type && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS) return( (UINT16)RootHubIndex << 8 ); // The type matches and the enumeration is successful, on the ROOT-HUB port
}
return( 0xFFFF );
}
/************************************************* ******************************
* Function Name: InitUSB_Host
* Description: Initialize the USB host
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
void InitUSB_Host( void) // initialize the USB host
{
    IE_USB = 0;
// LED_CFG = 1;
// LED_RUN = 0;
    USB_CTRL = bUC_HOST_MODE; // Set the mode first
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN;
    UH_RX_DMA = RxBuffer;
    UH_TX_DMA = TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN; // Start the USB host and DMA, and automatically pause before the interrupt flag is cleared
// UHUB0_CTRL = 0x00;
// UHUB1_CTRL = 0x00;
    UH_SETUP = bUH_SOF_EN;
    USB_INT_FG = 0xFF; // Clear interrupt flag
    DisableRootHubPort(0); // Clear
    DisableRootHubPort(1); // Clear
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
// IE_USB = 1; // query method
}
/************************************************* ******************************
* Function Name: mStopIfError
* Description: Check the operating status, if there is an error, display the error code and stop
* Input: UINT8 iError
* Output: None
* Return: None
************************************************** *****************************/
void mStopIfError( UINT8 iError)
{
    if (iError == ERR_SUCCESS)
    {
        return; // operation is successful
    }
    printf( "Error: %02X\n", (UINT16)iError ); // display error
    /* After encountering an error, you should analyze the error code and CH559DiskStatus status. For example, call CH559DiskReady to query whether the current U disk is connected. If the U disk is disconnected, then wait for the U disk to be plugged in and then operate.
       Suggested processing steps after error:
       1. Call CH559DiskReady once, and continue the operation if successful, such as Open, Read/Write, etc.
       2. If CH559DiskReady is unsuccessful, then forcibly start the operation from the beginning (waiting for U disk connection, CH559DiskReady, etc.) */
    while (1)
    {
// LED_TMP=0; // LED flashes
// mDelaymS( 100 );
// LED_TMP=1;
// mDelaymS( 100 );
    }
}
/************************************************* ******************************
* Function Name: mCopyCodeStringToIRAM
* Description: Copy the string in the program space to the internal RAM and return the string length
* Input: UINT8 idata *iDestination, destination string
                   UINT8 code *iSource source string
* Output: None
* Return: UINT8 i returns the number of characters
************************************************** *****************************/
UINT8 mCopyCodeStringToIRAM( UINT8 idata *iDestination, UINT8 code *iSource)
{
    UINT8 i = 0;
    while (*iDestination = *iSource)
    {
        iDestination ++;
        iSource ++;
        i ++;
    }
    return( i );
}
/************************************************* ******************************
* Function Name: CreateDirectory
* Description: Create a new directory and open it, if the directory already exists, open it directly. The directory name is in mCmdParam.Create.mPathName, which is the same as the file name rule
* Input:
* Output: None
* Return: ERR_SUCCESS = Successfully opened the directory or created the directory successfully,
                   ERR_FOUND_NAME = A file with the same name already exists,
                   ERR_MISS_DIR = The path name is invalid or the parent directory does not exist
************************************************** *****************************/
UINT8 CreateDirectory( void)
{
    UINT8 i, j;
    UINT32 UpDirCluster;
    PUINT8X DirXramBuf;
    UINT8 code *DirConstData;
    j = 0xFF;
    for (i = 0; i != sizeof( mCmdParam.Create.mPathName ); i ++) //Check the directory path
    {
        if (mCmdParam.Create.mPathName[ i] == 0)
        {
            break;
        }
        if (mCmdParam.Create.mPathName[ i] == PATH_SEPAR_CHAR1 || mCmdParam.Create.mPathName[ i] == PATH_SEPAR_CHAR2)
        {
            j = i; //Record the parent directory
        }
    }
    i = ERR_SUCCESS;
    if (j == 0 || j == 2 && mCmdParam.Create.mPathName[1] ==':')
    {
        UpDirCluster = 0; //Create a subdirectory under the root directory
    }
    else
    {
        if (j != 0xFF) //For absolute paths, the starting cluster number of the parent directory should be obtained
        {
            mCmdParam.Create.mPathName[ j] = 0;
            i = CH559FileOpen( ); //Open the parent directory
            if (i == ERR_SUCCESS)
            {
                i = ERR_MISS_DIR; //is a file instead of a directory
            }
            else if (i == ERR_OPEN_DIR)
            {
                i = ERR_SUCCESS; //Successfully opened the superior directory
            }
            mCmdParam.Create.mPathName[ j] = PATH_SEPAR_CHAR1; //Restore directory separator
        }
        UpDirCluster = CH559vStartCluster; //Save the starting cluster number of the upper-level directory
    }
    if (i == ERR_SUCCESS) //Successfully obtain the starting cluster number of the upper-level directory
    {
        i = CH559FileOpen( ); //Open this level subdirectory
        if (i == ERR_SUCCESS)
        {
            i = ERR_FOUND_NAME; //It is a file instead of a directory
        }
        else if (i == ERR_OPEN_DIR)
        {
            i = ERR_SUCCESS; //The directory already exists
        }
        else if (i == ERR_MISS_FILE) //The directory does not exist, you can create a new one
        {
            i = CH559FileCreate( ); //Create a directory by creating a file
            if (i == ERR_SUCCESS)
            {
                if (pDISK_FAT_BUF == pDISK_BASE_BUF)
                {
                    memset(pDISK_FAT_BUF,0,CH559vSectorSizeH*256); //If FILE_DATA_BUF is used with DISK_BASE_BUF, the disk buffer must be cleared
                }
                DirXramBuf = pDISK_FAT_BUF; //File data buffer
                DirConstData = ". \x10\x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x21\x30\x0\x0\x0\x0\x0\x0.. \x10 \x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x0\x21\x30\x0\x0\x0\x0\x0\x0";
                for (i = 0x40; i != 0; i -) //The reserved unit of the directory, which points to itself and the parent directory respectively
                {
                    *DirXramBuf = *DirConstData;
                    DirXramBuf ++;
                    DirConstData ++;
                }
                *(pDISK_FAT_BUF+0x1A) = ((PUINT8I)&CH559vStartCluster )[3];//Own starting cluster number
                *(pDISK_FAT_BUF+0x1B) = ((PUINT8I)&CH559vStartCluster )[2];
                *(pDISK_FAT_BUF+0x14) = ((PUINT8I)&CH559vStartCluster )[1];
                *(pDISK_FAT_BUF+0x15) = ((PUINT8I)&CH559vStartCluster )[0];
                *(pDISK_FAT_BUF+0x20+0x1A) = ((PUINT8I)&UpDirCluster )[3];//The starting cluster number of the upper-level directory
                *(pDISK_FAT_BUF+0x20+0x1B) = ((PUINT8I)&UpDirCluster )[2];
                *(pDISK_FAT_BUF+0x20+0x14) = ((PUINT8I)&UpDirCluster )[1];
                *(pDISK_FAT_BUF+0x20+0x15) = ((PUINT8I)&UpDirCluster )[0];
// for (count = 0x40; count != CH559vSectorSizeH*256; count ++) {/* Clear the rest of the directory area */
// *DirXramBuf = 0;
// DirXramBuf ++;
//}
                mCmdParam.Write.mSectorCount = 1;
                mCmdParam.Write.mDataBuffer = pDISK_FAT_BUF; //Point to the starting address of the file data buffer
                i = CH559FileWrite( ); //Write data to the file
                if (i == ERR_SUCCESS)
                {
                    DirXramBuf = pDISK_FAT_BUF;
                    for (i = 0x40; i != 0; i -) //Clear the directory area
                    {
                        *DirXramBuf = 0;
                        DirXramBuf ++;
                    }
                    for (j = 1; j != CH559vSecPerClus; j ++)
                    {
                        if (pDISK_FAT_BUF == pDISK_BASE_BUF)
                        {
                            memset(pDISK_FAT_BUF,0,CH559vSectorSizeH*256); //If FILE_DATA_BUF is used with DISK_BASE_BUF, the disk buffer must be cleared
                        }
                        mCmdParam.Write.mSectorCount = 1;
                        mCmdParam.Write.mDataBuffer = pDISK_FAT_BUF; //Point to the starting address of the file data buffer
                        i = CH559FileWrite( ); //Clear the remaining sectors of the directory
                        if (i != ERR_SUCCESS)
                        {
                            break;
                        }
                    }
                    if (j == CH559vSecPerClus) //Successfully empty the directory
                    {
                        mCmdParam.Modify.mFileSize = 0; //The length of the directory is always 0
                        mCmdParam.Modify.mFileDate = 0xFFFF;
                        mCmdParam.Modify.mFileTime = 0xFFFF;
                        mCmdParam.Modify.mFileAttr = 0x10; //Set directory attributes
                        i = CH559FileModify( ); //Modify file information to directory
                    }
                }
            }
        }
    }
    return( i );
}

void main()
{
    UINT8 s,i;
    UINT8 xdata buf[100]; //The length can be specified according to the application
    UINT16 loc;
// CfgFsys();
    mInitSTDIO( ); //In order to let the computer monitor the demonstration process through the serial port
    printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
    InitUSB_Host( );
    CH559LibInit( ); //Initialize CH559 library to support U disk files
    FoundNewDev = 0;
    printf( "Wait Device In\n" );
    while (1)
    {
        s = ERR_SUCCESS;
        if (UIF_DETECT) //Process if there is a USB host detection interrupt
        {
            UIF_DETECT = 0; //Clear interrupt flag
            s = AnalyzeRootHub( ); //Analyze ROOT-HUB status
            if (s == ERR_USB_CONNECT)
            {
                FoundNewDev = 1;
            }
        }
        if (FoundNewDev) // There is a new USB device inserted
        {
            FoundNewDev = 0;
            mDelaymS( 200 ); // Since the USB device has just been inserted and is not yet stable, wait for hundreds of milliseconds for the USB device to eliminate the plugging jitter
s = EnumAllRootDevice( ); // Enumerate USB devices of all ROOT-HUB ports
            loc = SearchTypeDevice( USB_DEV_CLASS_STORAGE ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
if (loc != 0xFFFF) {// found
printf( "Start UDISK_demo @CH559UFI library\n" );
// U disk operation process: USB bus reset, U disk connection, get device descriptor and set USB address, optional get configuration descriptor, then arrive here, CH559 subroutine library will continue to complete the follow-up work
i = (UINT8)( loc >> 8 );
SelectHubPort(i); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
                CH559DiskStatus = DISK_USB_ADDR;
                for (i = 0; i != 10; i ++)
                {
                    printf( "Wait DiskReady\n" );
                    s = CH559DiskReady( );
                    if (s == ERR_SUCCESS)
                    {
                        break;
                    }
                    mDelaymS( 50 );
                }
                printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
                if (CH559DiskStatus >= DISK_MOUNTED) //U disk is ready
                {
                    printf( "Create Level 1 Directory /YEAR2004 \n" );
                    strcpy( mCmdParam.Create.mPathName, "/YEAR2004" ); //Directory name, the directory is built in the root directory
                    i = CreateDirectory( ); //Create or open a directory
                    mStopIfError( i );
                    /* The directory is created or opened successfully, and a demo file is created in this subdirectory below */
                    printf( "Create New File /YEAR2004/DEMO2004.TXT \n" );
                    strcpy( mCmdParam.Create.mPathName, "/YEAR2004/DEMO2004.TXT" );//file name
                    i = CH559FileCreate( ); //Create a new file and open it, if the file already exists, delete it and then create it
                    mStopIfError( i );
                    printf( "Write some data to file DEMO2004.TXT \n" );
                    i = sprintf( buf, "demo file\xd\xa" );
                    mCmdParam.ByteWrite.mByteCount = i; //Specify the number of bytes written this time, the length of a single read and write cannot exceed MAX_BYTE_IO
                    mCmdParam.ByteWrite.mByteBuffer = buf; //Point to the buffer
                    i = CH559ByteWrite( ); //Write data to the file in bytes, and the length of a single read and write cannot exceed MAX_BYTE_IO
                    mStopIfError( i );
                    printf( "Close file DEMO2004.TXT \n" );
                    mCmdParam.Close.mUpdateLen = 1; //Automatically calculate the file length and write the file in bytes. It is recommended that the library close the file to automatically update the file length
                    i = CH559FileClose( );
                    mStopIfError( i );
                    /* Create a new second-level subdirectory below, the method is exactly the same as the previous first-level subdirectory */
                    printf( "Create Level 2 Directory /YEAR2004/MONTH05 \n" );
                    strcpy( mCmdParam.Create.mPathName, "/YEAR2004/MONTH05" ); //The directory name, the directory is built in the YEAR2004 subdirectory, and the YEAR2004 directory must exist in advance
                    i = CreateDirectory( ); //Create or open a directory
                    mStopIfError( i );
                    printf( "Close\n" );
                    mCmdParam.Close.mUpdateLen = 0; //No need to automatically update file length for directories
                    i = CH559FileClose( ); //Close the directory, the directory does not need to be closed, the closing is just to prevent the following misoperation
                    mStopIfError( i );
                }
                else
                {
                    printf( "U disk is not ready ERR =%02X\n", (UINT16)s );
                }
            }
            else
            {
                printf("Failed to initialize the USB flash drive, please unplug the USB flash drive and try again\n");
            }
        }
        mDelaymS( 100 ); // simulate the MCU to do other things
        SetUsbSpeed( 1 ); // The default is full speed
    }
}
